/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parse_bonus.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kaisuzuk <kaisuzuk@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/07/01 13:45:31 by kaisuzuk          #+#    #+#             */
/*   Updated: 2025/07/01 22:04:10 by kaisuzuk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "pipex.h"

t_bool parse_bonus(int argc, char *argv[])
{
	(void)argv; // とりあえずね
	if (argc < 5)
		return (FALSE); // 終了メッセージ考える
	return (TRUE);
}